zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_LCD.h
#define LCD_FDSR_FDCNT_MASK                      (0xFFU)
#define LCD_FDSR_FDCNT_SHIFT                     (0U)
/*! FDCNT - Fault Detect Counter */
#define LCD_FDSR_FDCNT(x)                        (((uint32_t)(((uint32_t)(x)) << LCD_FDSR_FDCNT_SHIFT)) & LCD_FDSR_FDCNT_MASK)

#define LCD_FDSR_FDCF_MASK                       (0x8000U)
#define LCD_FDSR_FDCF_SHIFT                      (15U)
/*! FDCF - Fault Detection Complete Flag
 *  0b0..Fault detection is not completed.
 *  0b1..Fault detection is completed.
 */
#define LCD_FDSR_FDCF(x)                         (((uint32_t)(((uint32_t)(x)) << LCD_FDSR_FDCF_SHIFT)) & LCD_FDSR_FDCF_MASK)
/*! @} */

/*! @name PEN - LCD Pin Enable register 0..LCD Pin Enable register 1 */
/*! @{ */

#define LCD_PEN_PIN_0_EN_MASK                    (0x1U)
#define LCD_PEN_PIN_0_EN_SHIFT                   (0U)
/*! PIN_0_EN - LCD Pin 0 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_0_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_0_EN_SHIFT)) & LCD_PEN_PIN_0_EN_MASK)

#define LCD_PEN_PIN_32_EN_MASK                   (0x1U)
#define LCD_PEN_PIN_32_EN_SHIFT                  (0U)
/*! PIN_32_EN - LCD Pin 32 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_32_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_32_EN_SHIFT)) & LCD_PEN_PIN_32_EN_MASK)

#define LCD_PEN_PIN_1_EN_MASK                    (0x2U)
#define LCD_PEN_PIN_1_EN_SHIFT                   (1U)
/*! PIN_1_EN - LCD Pin 1 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_1_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_1_EN_SHIFT)) & LCD_PEN_PIN_1_EN_MASK)

#define LCD_PEN_PIN_33_EN_MASK                   (0x2U)
#define LCD_PEN_PIN_33_EN_SHIFT                  (1U)
/*! PIN_33_EN - LCD Pin 33 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_33_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_33_EN_SHIFT)) & LCD_PEN_PIN_33_EN_MASK)

#define LCD_PEN_PIN_2_EN_MASK                    (0x4U)
#define LCD_PEN_PIN_2_EN_SHIFT                   (2U)
/*! PIN_2_EN - LCD Pin 2 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_2_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_2_EN_SHIFT)) & LCD_PEN_PIN_2_EN_MASK)

#define LCD_PEN_PIN_34_EN_MASK                   (0x4U)
#define LCD_PEN_PIN_34_EN_SHIFT                  (2U)
/*! PIN_34_EN - LCD Pin 34 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_34_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_34_EN_SHIFT)) & LCD_PEN_PIN_34_EN_MASK)

#define LCD_PEN_PIN_3_EN_MASK                    (0x8U)
#define LCD_PEN_PIN_3_EN_SHIFT                   (3U)
/*! PIN_3_EN - LCD Pin 3 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_3_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_3_EN_SHIFT)) & LCD_PEN_PIN_3_EN_MASK)

#define LCD_PEN_PIN_35_EN_MASK                   (0x8U)
#define LCD_PEN_PIN_35_EN_SHIFT                  (3U)
/*! PIN_35_EN - LCD Pin 35 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_35_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_35_EN_SHIFT)) & LCD_PEN_PIN_35_EN_MASK)

#define LCD_PEN_PIN_4_EN_MASK                    (0x10U)
#define LCD_PEN_PIN_4_EN_SHIFT                   (4U)
/*! PIN_4_EN - LCD Pin 4 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_4_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_4_EN_SHIFT)) & LCD_PEN_PIN_4_EN_MASK)

#define LCD_PEN_PIN_36_EN_MASK                   (0x10U)
#define LCD_PEN_PIN_36_EN_SHIFT                  (4U)
/*! PIN_36_EN - LCD Pin 36 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_36_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_36_EN_SHIFT)) & LCD_PEN_PIN_36_EN_MASK)

#define LCD_PEN_PIN_5_EN_MASK                    (0x20U)
#define LCD_PEN_PIN_5_EN_SHIFT                   (5U)
/*! PIN_5_EN - LCD Pin 5 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_5_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_5_EN_SHIFT)) & LCD_PEN_PIN_5_EN_MASK)

#define LCD_PEN_PIN_37_EN_MASK                   (0x20U)
#define LCD_PEN_PIN_37_EN_SHIFT                  (5U)
/*! PIN_37_EN - LCD Pin 37 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_37_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_37_EN_SHIFT)) & LCD_PEN_PIN_37_EN_MASK)

#define LCD_PEN_PIN_6_EN_MASK                    (0x40U)
#define LCD_PEN_PIN_6_EN_SHIFT                   (6U)
/*! PIN_6_EN - LCD Pin 6 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_6_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_6_EN_SHIFT)) & LCD_PEN_PIN_6_EN_MASK)

#define LCD_PEN_PIN_38_EN_MASK                   (0x40U)
#define LCD_PEN_PIN_38_EN_SHIFT                  (6U)
/*! PIN_38_EN - LCD Pin 38 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_38_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_38_EN_SHIFT)) & LCD_PEN_PIN_38_EN_MASK)

#define LCD_PEN_PIN_7_EN_MASK                    (0x80U)
#define LCD_PEN_PIN_7_EN_SHIFT                   (7U)
/*! PIN_7_EN - LCD Pin 7 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_7_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_7_EN_SHIFT)) & LCD_PEN_PIN_7_EN_MASK)

#define LCD_PEN_PIN_39_EN_MASK                   (0x80U)
#define LCD_PEN_PIN_39_EN_SHIFT                  (7U)
/*! PIN_39_EN - LCD Pin 39 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_39_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_39_EN_SHIFT)) & LCD_PEN_PIN_39_EN_MASK)

#define LCD_PEN_PIN_8_EN_MASK                    (0x100U)
#define LCD_PEN_PIN_8_EN_SHIFT                   (8U)
/*! PIN_8_EN - LCD Pin 8 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_8_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_8_EN_SHIFT)) & LCD_PEN_PIN_8_EN_MASK)

#define LCD_PEN_PIN_40_EN_MASK                   (0x100U)
#define LCD_PEN_PIN_40_EN_SHIFT                  (8U)
/*! PIN_40_EN - LCD Pin 40 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_40_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_40_EN_SHIFT)) & LCD_PEN_PIN_40_EN_MASK)

#define LCD_PEN_PIN_9_EN_MASK                    (0x200U)
#define LCD_PEN_PIN_9_EN_SHIFT                   (9U)
/*! PIN_9_EN - LCD Pin 9 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_9_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_9_EN_SHIFT)) & LCD_PEN_PIN_9_EN_MASK)

#define LCD_PEN_PIN_41_EN_MASK                   (0x200U)
#define LCD_PEN_PIN_41_EN_SHIFT                  (9U)
/*! PIN_41_EN - LCD Pin 41 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_41_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_41_EN_SHIFT)) & LCD_PEN_PIN_41_EN_MASK)

#define LCD_PEN_PIN_10_EN_MASK                   (0x400U)
#define LCD_PEN_PIN_10_EN_SHIFT                  (10U)
/*! PIN_10_EN - LCD Pin 10 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_10_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_10_EN_SHIFT)) & LCD_PEN_PIN_10_EN_MASK)

