zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_LCD.h
#define LCD_PEN_PIN_42_EN_MASK                   (0x400U)
#define LCD_PEN_PIN_42_EN_SHIFT                  (10U)
/*! PIN_42_EN - LCD Pin 42 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_42_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_42_EN_SHIFT)) & LCD_PEN_PIN_42_EN_MASK)

#define LCD_PEN_PIN_11_EN_MASK                   (0x800U)
#define LCD_PEN_PIN_11_EN_SHIFT                  (11U)
/*! PIN_11_EN - LCD Pin 11 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_11_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_11_EN_SHIFT)) & LCD_PEN_PIN_11_EN_MASK)

#define LCD_PEN_PIN_43_EN_MASK                   (0x800U)
#define LCD_PEN_PIN_43_EN_SHIFT                  (11U)
/*! PIN_43_EN - LCD Pin 43 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_43_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_43_EN_SHIFT)) & LCD_PEN_PIN_43_EN_MASK)

#define LCD_PEN_PIN_12_EN_MASK                   (0x1000U)
#define LCD_PEN_PIN_12_EN_SHIFT                  (12U)
/*! PIN_12_EN - LCD Pin 12 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_12_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_12_EN_SHIFT)) & LCD_PEN_PIN_12_EN_MASK)

#define LCD_PEN_PIN_44_EN_MASK                   (0x1000U)
#define LCD_PEN_PIN_44_EN_SHIFT                  (12U)
/*! PIN_44_EN - LCD Pin 44 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_44_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_44_EN_SHIFT)) & LCD_PEN_PIN_44_EN_MASK)

#define LCD_PEN_PIN_13_EN_MASK                   (0x2000U)
#define LCD_PEN_PIN_13_EN_SHIFT                  (13U)
/*! PIN_13_EN - LCD Pin 13 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_13_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_13_EN_SHIFT)) & LCD_PEN_PIN_13_EN_MASK)

#define LCD_PEN_PIN_45_EN_MASK                   (0x2000U)
#define LCD_PEN_PIN_45_EN_SHIFT                  (13U)
/*! PIN_45_EN - LCD Pin 45 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_45_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_45_EN_SHIFT)) & LCD_PEN_PIN_45_EN_MASK)

#define LCD_PEN_PIN_14_EN_MASK                   (0x4000U)
#define LCD_PEN_PIN_14_EN_SHIFT                  (14U)
/*! PIN_14_EN - LCD Pin 14 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_14_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_14_EN_SHIFT)) & LCD_PEN_PIN_14_EN_MASK)

#define LCD_PEN_PIN_46_EN_MASK                   (0x4000U)
#define LCD_PEN_PIN_46_EN_SHIFT                  (14U)
/*! PIN_46_EN - LCD Pin 46 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_46_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_46_EN_SHIFT)) & LCD_PEN_PIN_46_EN_MASK)

#define LCD_PEN_PIN_15_EN_MASK                   (0x8000U)
#define LCD_PEN_PIN_15_EN_SHIFT                  (15U)
/*! PIN_15_EN - LCD Pin 15 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_15_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_15_EN_SHIFT)) & LCD_PEN_PIN_15_EN_MASK)

#define LCD_PEN_PIN_47_EN_MASK                   (0x8000U)
#define LCD_PEN_PIN_47_EN_SHIFT                  (15U)
/*! PIN_47_EN - LCD Pin 47 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_47_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_47_EN_SHIFT)) & LCD_PEN_PIN_47_EN_MASK)

#define LCD_PEN_PIN_16_EN_MASK                   (0x10000U)
#define LCD_PEN_PIN_16_EN_SHIFT                  (16U)
/*! PIN_16_EN - LCD Pin 16 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_16_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_16_EN_SHIFT)) & LCD_PEN_PIN_16_EN_MASK)

#define LCD_PEN_PIN_17_EN_MASK                   (0x20000U)
#define LCD_PEN_PIN_17_EN_SHIFT                  (17U)
/*! PIN_17_EN - LCD Pin 17 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_17_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_17_EN_SHIFT)) & LCD_PEN_PIN_17_EN_MASK)

#define LCD_PEN_PIN_18_EN_MASK                   (0x40000U)
#define LCD_PEN_PIN_18_EN_SHIFT                  (18U)
/*! PIN_18_EN - LCD Pin 18 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_18_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_18_EN_SHIFT)) & LCD_PEN_PIN_18_EN_MASK)

#define LCD_PEN_PIN_19_EN_MASK                   (0x80000U)
#define LCD_PEN_PIN_19_EN_SHIFT                  (19U)
/*! PIN_19_EN - LCD Pin 19 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_19_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_19_EN_SHIFT)) & LCD_PEN_PIN_19_EN_MASK)

#define LCD_PEN_PIN_20_EN_MASK                   (0x100000U)
#define LCD_PEN_PIN_20_EN_SHIFT                  (20U)
/*! PIN_20_EN - LCD Pin 20 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_20_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_20_EN_SHIFT)) & LCD_PEN_PIN_20_EN_MASK)

#define LCD_PEN_PIN_21_EN_MASK                   (0x200000U)
#define LCD_PEN_PIN_21_EN_SHIFT                  (21U)
/*! PIN_21_EN - LCD Pin 21 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_21_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_21_EN_SHIFT)) & LCD_PEN_PIN_21_EN_MASK)

#define LCD_PEN_PIN_22_EN_MASK                   (0x400000U)
#define LCD_PEN_PIN_22_EN_SHIFT                  (22U)
/*! PIN_22_EN - LCD Pin 22 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_22_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_22_EN_SHIFT)) & LCD_PEN_PIN_22_EN_MASK)

#define LCD_PEN_PIN_23_EN_MASK                   (0x800000U)
#define LCD_PEN_PIN_23_EN_SHIFT                  (23U)
/*! PIN_23_EN - LCD Pin 23 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_23_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_23_EN_SHIFT)) & LCD_PEN_PIN_23_EN_MASK)

#define LCD_PEN_PIN_24_EN_MASK                   (0x1000000U)
#define LCD_PEN_PIN_24_EN_SHIFT                  (24U)
/*! PIN_24_EN - LCD Pin 24 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_24_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_24_EN_SHIFT)) & LCD_PEN_PIN_24_EN_MASK)

#define LCD_PEN_PIN_25_EN_MASK                   (0x2000000U)
#define LCD_PEN_PIN_25_EN_SHIFT                  (25U)
/*! PIN_25_EN - LCD Pin 25 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_25_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_25_EN_SHIFT)) & LCD_PEN_PIN_25_EN_MASK)

#define LCD_PEN_PIN_26_EN_MASK                   (0x4000000U)
#define LCD_PEN_PIN_26_EN_SHIFT                  (26U)
/*! PIN_26_EN - LCD Pin 26 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_26_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_26_EN_SHIFT)) & LCD_PEN_PIN_26_EN_MASK)

#define LCD_PEN_PIN_27_EN_MASK                   (0x8000000U)
#define LCD_PEN_PIN_27_EN_SHIFT                  (27U)
/*! PIN_27_EN - LCD Pin 27 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_27_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_27_EN_SHIFT)) & LCD_PEN_PIN_27_EN_MASK)

#define LCD_PEN_PIN_28_EN_MASK                   (0x10000000U)
#define LCD_PEN_PIN_28_EN_SHIFT                  (28U)
/*! PIN_28_EN - LCD Pin 28 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_28_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_28_EN_SHIFT)) & LCD_PEN_PIN_28_EN_MASK)

#define LCD_PEN_PIN_29_EN_MASK                   (0x20000000U)
#define LCD_PEN_PIN_29_EN_SHIFT                  (29U)
/*! PIN_29_EN - LCD Pin 29 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_29_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_29_EN_SHIFT)) & LCD_PEN_PIN_29_EN_MASK)

#define LCD_PEN_PIN_30_EN_MASK                   (0x40000000U)
#define LCD_PEN_PIN_30_EN_SHIFT                  (30U)
/*! PIN_30_EN - LCD Pin 30 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_30_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_30_EN_SHIFT)) & LCD_PEN_PIN_30_EN_MASK)

#define LCD_PEN_PIN_31_EN_MASK                   (0x80000000U)
#define LCD_PEN_PIN_31_EN_SHIFT                  (31U)
/*! PIN_31_EN - LCD Pin 31 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define LCD_PEN_PIN_31_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LCD_PEN_PIN_31_EN_SHIFT)) & LCD_PEN_PIN_31_EN_MASK)
/*! @} */

/*! @name BPEN - LCD Back Plane Enable register 0..LCD Back Plane Enable register 1 */
/*! @{ */

#define LCD_BPEN_PIN_0_BPEN_MASK                 (0x1U)
#define LCD_BPEN_PIN_0_BPEN_SHIFT                (0U)
/*! PIN_0_BPEN - LCD Pin 0 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_0_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_0_BPEN_SHIFT)) & LCD_BPEN_PIN_0_BPEN_MASK)

