zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_LCD.h
#define LCD_BPEN_PIN_32_BPEN_MASK                (0x1U)
#define LCD_BPEN_PIN_32_BPEN_SHIFT               (0U)
/*! PIN_32_BPEN - LCD Pin 32 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_32_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_32_BPEN_SHIFT)) & LCD_BPEN_PIN_32_BPEN_MASK)

#define LCD_BPEN_PIN_1_BPEN_MASK                 (0x2U)
#define LCD_BPEN_PIN_1_BPEN_SHIFT                (1U)
/*! PIN_1_BPEN - LCD Pin 1 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_1_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_1_BPEN_SHIFT)) & LCD_BPEN_PIN_1_BPEN_MASK)

#define LCD_BPEN_PIN_33_BPEN_MASK                (0x2U)
#define LCD_BPEN_PIN_33_BPEN_SHIFT               (1U)
/*! PIN_33_BPEN - LCD Pin 33 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_33_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_33_BPEN_SHIFT)) & LCD_BPEN_PIN_33_BPEN_MASK)

#define LCD_BPEN_PIN_2_BPEN_MASK                 (0x4U)
#define LCD_BPEN_PIN_2_BPEN_SHIFT                (2U)
/*! PIN_2_BPEN - LCD Pin 2 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_2_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_2_BPEN_SHIFT)) & LCD_BPEN_PIN_2_BPEN_MASK)

#define LCD_BPEN_PIN_34_BPEN_MASK                (0x4U)
#define LCD_BPEN_PIN_34_BPEN_SHIFT               (2U)
/*! PIN_34_BPEN - LCD Pin 34 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_34_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_34_BPEN_SHIFT)) & LCD_BPEN_PIN_34_BPEN_MASK)

#define LCD_BPEN_PIN_3_BPEN_MASK                 (0x8U)
#define LCD_BPEN_PIN_3_BPEN_SHIFT                (3U)
/*! PIN_3_BPEN - LCD Pin 3 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_3_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_3_BPEN_SHIFT)) & LCD_BPEN_PIN_3_BPEN_MASK)

#define LCD_BPEN_PIN_35_BPEN_MASK                (0x8U)
#define LCD_BPEN_PIN_35_BPEN_SHIFT               (3U)
/*! PIN_35_BPEN - LCD Pin 35 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_35_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_35_BPEN_SHIFT)) & LCD_BPEN_PIN_35_BPEN_MASK)

#define LCD_BPEN_PIN_4_BPEN_MASK                 (0x10U)
#define LCD_BPEN_PIN_4_BPEN_SHIFT                (4U)
/*! PIN_4_BPEN - LCD Pin 4 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_4_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_4_BPEN_SHIFT)) & LCD_BPEN_PIN_4_BPEN_MASK)

#define LCD_BPEN_PIN_36_BPEN_MASK                (0x10U)
#define LCD_BPEN_PIN_36_BPEN_SHIFT               (4U)
/*! PIN_36_BPEN - LCD Pin 36 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_36_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_36_BPEN_SHIFT)) & LCD_BPEN_PIN_36_BPEN_MASK)

#define LCD_BPEN_PIN_5_BPEN_MASK                 (0x20U)
#define LCD_BPEN_PIN_5_BPEN_SHIFT                (5U)
/*! PIN_5_BPEN - LCD Pin 5 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_5_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_5_BPEN_SHIFT)) & LCD_BPEN_PIN_5_BPEN_MASK)

#define LCD_BPEN_PIN_37_BPEN_MASK                (0x20U)
#define LCD_BPEN_PIN_37_BPEN_SHIFT               (5U)
/*! PIN_37_BPEN - LCD Pin 37 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_37_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_37_BPEN_SHIFT)) & LCD_BPEN_PIN_37_BPEN_MASK)

#define LCD_BPEN_PIN_6_BPEN_MASK                 (0x40U)
#define LCD_BPEN_PIN_6_BPEN_SHIFT                (6U)
/*! PIN_6_BPEN - LCD Pin 6 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_6_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_6_BPEN_SHIFT)) & LCD_BPEN_PIN_6_BPEN_MASK)

#define LCD_BPEN_PIN_38_BPEN_MASK                (0x40U)
#define LCD_BPEN_PIN_38_BPEN_SHIFT               (6U)
/*! PIN_38_BPEN - LCD Pin 38 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_38_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_38_BPEN_SHIFT)) & LCD_BPEN_PIN_38_BPEN_MASK)

#define LCD_BPEN_PIN_7_BPEN_MASK                 (0x80U)
#define LCD_BPEN_PIN_7_BPEN_SHIFT                (7U)
/*! PIN_7_BPEN - LCD Pin 7 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_7_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_7_BPEN_SHIFT)) & LCD_BPEN_PIN_7_BPEN_MASK)

#define LCD_BPEN_PIN_39_BPEN_MASK                (0x80U)
#define LCD_BPEN_PIN_39_BPEN_SHIFT               (7U)
/*! PIN_39_BPEN - LCD Pin 39 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_39_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_39_BPEN_SHIFT)) & LCD_BPEN_PIN_39_BPEN_MASK)

#define LCD_BPEN_PIN_8_BPEN_MASK                 (0x100U)
#define LCD_BPEN_PIN_8_BPEN_SHIFT                (8U)
/*! PIN_8_BPEN - LCD Pin 8 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_8_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_8_BPEN_SHIFT)) & LCD_BPEN_PIN_8_BPEN_MASK)

#define LCD_BPEN_PIN_40_BPEN_MASK                (0x100U)
#define LCD_BPEN_PIN_40_BPEN_SHIFT               (8U)
/*! PIN_40_BPEN - LCD Pin 40 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_40_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_40_BPEN_SHIFT)) & LCD_BPEN_PIN_40_BPEN_MASK)

#define LCD_BPEN_PIN_9_BPEN_MASK                 (0x200U)
#define LCD_BPEN_PIN_9_BPEN_SHIFT                (9U)
/*! PIN_9_BPEN - LCD Pin 9 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_9_BPEN(x)                   (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_9_BPEN_SHIFT)) & LCD_BPEN_PIN_9_BPEN_MASK)

