zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_LCD.h
#define LCD_BPEN_PIN_41_BPEN_MASK                (0x200U)
#define LCD_BPEN_PIN_41_BPEN_SHIFT               (9U)
/*! PIN_41_BPEN - LCD Pin 41 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_41_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_41_BPEN_SHIFT)) & LCD_BPEN_PIN_41_BPEN_MASK)

#define LCD_BPEN_PIN_10_BPEN_MASK                (0x400U)
#define LCD_BPEN_PIN_10_BPEN_SHIFT               (10U)
/*! PIN_10_BPEN - LCD Pin 10 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_10_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_10_BPEN_SHIFT)) & LCD_BPEN_PIN_10_BPEN_MASK)

#define LCD_BPEN_PIN_42_BPEN_MASK                (0x400U)
#define LCD_BPEN_PIN_42_BPEN_SHIFT               (10U)
/*! PIN_42_BPEN - LCD Pin 42 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_42_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_42_BPEN_SHIFT)) & LCD_BPEN_PIN_42_BPEN_MASK)

#define LCD_BPEN_PIN_11_BPEN_MASK                (0x800U)
#define LCD_BPEN_PIN_11_BPEN_SHIFT               (11U)
/*! PIN_11_BPEN - LCD Pin 11 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_11_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_11_BPEN_SHIFT)) & LCD_BPEN_PIN_11_BPEN_MASK)

#define LCD_BPEN_PIN_43_BPEN_MASK                (0x800U)
#define LCD_BPEN_PIN_43_BPEN_SHIFT               (11U)
/*! PIN_43_BPEN - LCD Pin 43 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_43_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_43_BPEN_SHIFT)) & LCD_BPEN_PIN_43_BPEN_MASK)

#define LCD_BPEN_PIN_12_BPEN_MASK                (0x1000U)
#define LCD_BPEN_PIN_12_BPEN_SHIFT               (12U)
/*! PIN_12_BPEN - LCD Pin 12 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_12_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_12_BPEN_SHIFT)) & LCD_BPEN_PIN_12_BPEN_MASK)

#define LCD_BPEN_PIN_44_BPEN_MASK                (0x1000U)
#define LCD_BPEN_PIN_44_BPEN_SHIFT               (12U)
/*! PIN_44_BPEN - LCD Pin 44 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_44_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_44_BPEN_SHIFT)) & LCD_BPEN_PIN_44_BPEN_MASK)

#define LCD_BPEN_PIN_13_BPEN_MASK                (0x2000U)
#define LCD_BPEN_PIN_13_BPEN_SHIFT               (13U)
/*! PIN_13_BPEN - LCD Pin 13 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_13_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_13_BPEN_SHIFT)) & LCD_BPEN_PIN_13_BPEN_MASK)

#define LCD_BPEN_PIN_45_BPEN_MASK                (0x2000U)
#define LCD_BPEN_PIN_45_BPEN_SHIFT               (13U)
/*! PIN_45_BPEN - LCD Pin 45 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_45_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_45_BPEN_SHIFT)) & LCD_BPEN_PIN_45_BPEN_MASK)

#define LCD_BPEN_PIN_14_BPEN_MASK                (0x4000U)
#define LCD_BPEN_PIN_14_BPEN_SHIFT               (14U)
/*! PIN_14_BPEN - LCD Pin 14 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_14_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_14_BPEN_SHIFT)) & LCD_BPEN_PIN_14_BPEN_MASK)

#define LCD_BPEN_PIN_46_BPEN_MASK                (0x4000U)
#define LCD_BPEN_PIN_46_BPEN_SHIFT               (14U)
/*! PIN_46_BPEN - LCD Pin 46 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_46_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_46_BPEN_SHIFT)) & LCD_BPEN_PIN_46_BPEN_MASK)

#define LCD_BPEN_PIN_15_BPEN_MASK                (0x8000U)
#define LCD_BPEN_PIN_15_BPEN_SHIFT               (15U)
/*! PIN_15_BPEN - LCD Pin 15 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_15_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_15_BPEN_SHIFT)) & LCD_BPEN_PIN_15_BPEN_MASK)

#define LCD_BPEN_PIN_47_BPEN_MASK                (0x8000U)
#define LCD_BPEN_PIN_47_BPEN_SHIFT               (15U)
/*! PIN_47_BPEN - LCD Pin 47 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_47_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_47_BPEN_SHIFT)) & LCD_BPEN_PIN_47_BPEN_MASK)

#define LCD_BPEN_PIN_16_BPEN_MASK                (0x10000U)
#define LCD_BPEN_PIN_16_BPEN_SHIFT               (16U)
/*! PIN_16_BPEN - LCD Pin 16 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_16_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_16_BPEN_SHIFT)) & LCD_BPEN_PIN_16_BPEN_MASK)

#define LCD_BPEN_PIN_17_BPEN_MASK                (0x20000U)
#define LCD_BPEN_PIN_17_BPEN_SHIFT               (17U)
/*! PIN_17_BPEN - LCD Pin 17 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_17_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_17_BPEN_SHIFT)) & LCD_BPEN_PIN_17_BPEN_MASK)

#define LCD_BPEN_PIN_18_BPEN_MASK                (0x40000U)
#define LCD_BPEN_PIN_18_BPEN_SHIFT               (18U)
/*! PIN_18_BPEN - LCD Pin 18 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_18_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_18_BPEN_SHIFT)) & LCD_BPEN_PIN_18_BPEN_MASK)

#define LCD_BPEN_PIN_19_BPEN_MASK                (0x80000U)
#define LCD_BPEN_PIN_19_BPEN_SHIFT               (19U)
/*! PIN_19_BPEN - LCD Pin 19 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_19_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_19_BPEN_SHIFT)) & LCD_BPEN_PIN_19_BPEN_MASK)

