zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_LCD.h
#define LCD_BPEN_PIN_20_BPEN_MASK                (0x100000U)
#define LCD_BPEN_PIN_20_BPEN_SHIFT               (20U)
/*! PIN_20_BPEN - LCD Pin 20 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_20_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_20_BPEN_SHIFT)) & LCD_BPEN_PIN_20_BPEN_MASK)

#define LCD_BPEN_PIN_21_BPEN_MASK                (0x200000U)
#define LCD_BPEN_PIN_21_BPEN_SHIFT               (21U)
/*! PIN_21_BPEN - LCD Pin 21 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_21_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_21_BPEN_SHIFT)) & LCD_BPEN_PIN_21_BPEN_MASK)

#define LCD_BPEN_PIN_22_BPEN_MASK                (0x400000U)
#define LCD_BPEN_PIN_22_BPEN_SHIFT               (22U)
/*! PIN_22_BPEN - LCD Pin 22 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_22_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_22_BPEN_SHIFT)) & LCD_BPEN_PIN_22_BPEN_MASK)

#define LCD_BPEN_PIN_23_BPEN_MASK                (0x800000U)
#define LCD_BPEN_PIN_23_BPEN_SHIFT               (23U)
/*! PIN_23_BPEN - LCD Pin 23 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_23_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_23_BPEN_SHIFT)) & LCD_BPEN_PIN_23_BPEN_MASK)

#define LCD_BPEN_PIN_24_BPEN_MASK                (0x1000000U)
#define LCD_BPEN_PIN_24_BPEN_SHIFT               (24U)
/*! PIN_24_BPEN - LCD Pin 24 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_24_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_24_BPEN_SHIFT)) & LCD_BPEN_PIN_24_BPEN_MASK)

#define LCD_BPEN_PIN_25_BPEN_MASK                (0x2000000U)
#define LCD_BPEN_PIN_25_BPEN_SHIFT               (25U)
/*! PIN_25_BPEN - LCD Pin 25 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_25_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_25_BPEN_SHIFT)) & LCD_BPEN_PIN_25_BPEN_MASK)

#define LCD_BPEN_PIN_26_BPEN_MASK                (0x4000000U)
#define LCD_BPEN_PIN_26_BPEN_SHIFT               (26U)
/*! PIN_26_BPEN - LCD Pin 26 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_26_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_26_BPEN_SHIFT)) & LCD_BPEN_PIN_26_BPEN_MASK)

#define LCD_BPEN_PIN_27_BPEN_MASK                (0x8000000U)
#define LCD_BPEN_PIN_27_BPEN_SHIFT               (27U)
/*! PIN_27_BPEN - LCD Pin 27 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_27_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_27_BPEN_SHIFT)) & LCD_BPEN_PIN_27_BPEN_MASK)

#define LCD_BPEN_PIN_28_BPEN_MASK                (0x10000000U)
#define LCD_BPEN_PIN_28_BPEN_SHIFT               (28U)
/*! PIN_28_BPEN - LCD Pin 28 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_28_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_28_BPEN_SHIFT)) & LCD_BPEN_PIN_28_BPEN_MASK)

#define LCD_BPEN_PIN_29_BPEN_MASK                (0x20000000U)
#define LCD_BPEN_PIN_29_BPEN_SHIFT               (29U)
/*! PIN_29_BPEN - LCD Pin 29 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_29_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_29_BPEN_SHIFT)) & LCD_BPEN_PIN_29_BPEN_MASK)

#define LCD_BPEN_PIN_30_BPEN_MASK                (0x40000000U)
#define LCD_BPEN_PIN_30_BPEN_SHIFT               (30U)
/*! PIN_30_BPEN - LCD Pin 30 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_30_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_30_BPEN_SHIFT)) & LCD_BPEN_PIN_30_BPEN_MASK)

#define LCD_BPEN_PIN_31_BPEN_MASK                (0x80000000U)
#define LCD_BPEN_PIN_31_BPEN_SHIFT               (31U)
/*! PIN_31_BPEN - LCD Pin 31 Back Plane Enable
 *  0b0..Pin as Front Plane
 *  0b1..Pin as Back Plane
 */
#define LCD_BPEN_PIN_31_BPEN(x)                  (((uint32_t)(((uint32_t)(x)) << LCD_BPEN_PIN_31_BPEN_SHIFT)) & LCD_BPEN_PIN_31_BPEN_MASK)
/*! @} */

/*! @name WF8B - LCD Waveform 0 Register..LCD Waveform 47 Register */
/*! @{ */

#define LCD_WF8B_WF_MASK                         (0xFFU)
#define LCD_WF8B_WF_SHIFT                        (0U)
/*! WF - Pin Waveform */
#define LCD_WF8B_WF(x)                           (((uint8_t)(((uint8_t)(x)) << LCD_WF8B_WF_SHIFT)) & LCD_WF8B_WF_MASK)
/*! @} */

/* The count of LCD_WF8B */
#define LCD_WF8B_COUNT                           (48U)

/*! @name WF - LCD Waveform 3 to 0 Register..LCD Waveform 47 to 44 Register */
/*! @{ */

#define LCD_WF_WF0_MASK                          (0xFFU)
#define LCD_WF_WF0_SHIFT                         (0U)
/*! WF0 - Waveform Pin 0 */
#define LCD_WF_WF0(x)                            (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF0_SHIFT)) & LCD_WF_WF0_MASK)

#define LCD_WF_WF4_MASK                          (0xFFU)
#define LCD_WF_WF4_SHIFT                         (0U)
/*! WF4 - Waveform Pin 4 */
#define LCD_WF_WF4(x)                            (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF4_SHIFT)) & LCD_WF_WF4_MASK)

#define LCD_WF_WF8_MASK                          (0xFFU)
#define LCD_WF_WF8_SHIFT                         (0U)
/*! WF8 - Waveform Pin 8 */
#define LCD_WF_WF8(x)                            (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF8_SHIFT)) & LCD_WF_WF8_MASK)

#define LCD_WF_WF12_MASK                         (0xFFU)
#define LCD_WF_WF12_SHIFT                        (0U)
/*! WF12 - Waveform Pin 12 */
#define LCD_WF_WF12(x)                           (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF12_SHIFT)) & LCD_WF_WF12_MASK)

#define LCD_WF_WF16_MASK                         (0xFFU)
#define LCD_WF_WF16_SHIFT                        (0U)
/*! WF16 - Waveform Pin 16 */
#define LCD_WF_WF16(x)                           (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF16_SHIFT)) & LCD_WF_WF16_MASK)

#define LCD_WF_WF20_MASK                         (0xFFU)
#define LCD_WF_WF20_SHIFT                        (0U)
/*! WF20 - Waveform Pin 20 */
#define LCD_WF_WF20(x)                           (((uint32_t)(((uint32_t)(x)) << LCD_WF_WF20_SHIFT)) & LCD_WF_WF20_MASK)

